cmsis-svd/cmsis-svd/data/Atmel/ATSAMS70N21.svd
               <register>
                  <name>XDMAC_CID</name>
                  <description>Channel Interrupt Disable Register (chid = 0)</description>
                  <addressOffset>0x04</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>BID</name>
                        <description>End of Block Interrupt Disable Bit</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LID</name>
                        <description>End of Linked List Interrupt Disable Bit</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DID</name>
                        <description>End of Disable Interrupt Disable Bit</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FID</name>
                        <description>End of Flush Interrupt Disable Bit</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RBEID</name>
                        <description>Read Bus Error Interrupt Disable Bit</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WBEID</name>
                        <description>Write Bus Error Interrupt Disable Bit</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ROID</name>
                        <description>Request Overflow Error Interrupt Disable Bit</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CIM</name>
                  <description>Channel Interrupt Mask Register (chid = 0)</description>
                  <addressOffset>0x08</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>BIM</name>
                        <description>End of Block Interrupt Mask Bit</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LIM</name>
                        <description>End of Linked List Interrupt Mask Bit</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIM</name>
                        <description>End of Disable Interrupt Mask Bit</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIM</name>
                        <description>End of Flush Interrupt Mask Bit</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RBEIM</name>
                        <description>Read Bus Error Interrupt Mask Bit</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WBEIM</name>
                        <description>Write Bus Error Interrupt Mask Bit</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ROIM</name>
                        <description>Request Overflow Error Interrupt Mask Bit</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CIS</name>
                  <description>Channel Interrupt Status Register (chid = 0)</description>
                  <addressOffset>0x0C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>BIS</name>
                        <description>End of Block Interrupt Status Bit</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LIS</name>
                        <description>End of Linked List Interrupt Status Bit</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIS</name>
                        <description>End of Disable Interrupt Status Bit</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIS</name>
                        <description>End of Flush Interrupt Status Bit</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RBEIS</name>
                        <description>Read Bus Error Interrupt Status Bit</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WBEIS</name>
                        <description>Write Bus Error Interrupt Status Bit</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ROIS</name>
                        <description>Request Overflow Error Interrupt Status Bit</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CSA</name>
                  <description>Channel Source Address Register (chid = 0)</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>SA</name>
                        <description>Channel x Source Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CDA</name>
                  <description>Channel Destination Address Register (chid = 0)</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>DA</name>
                        <description>Channel x Destination Address</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CNDA</name>
                  <description>Channel Next Descriptor Address Register (chid = 0)</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>NDAIF</name>
                        <description>Channel x Next Descriptor Interface</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>NDA</name>
                        <description>Channel x Next Descriptor Address</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>30</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CNDC</name>
                  <description>Channel Next Descriptor Control Register (chid = 0)</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>NDE</name>
                        <description>Channel x Next Descriptor Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>NDESelect</name>
                           <enumeratedValue>
                              <name>DSCR_FETCH_DIS</name>
                              <description>Descriptor fetch is disabled.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DSCR_FETCH_EN</name>
                              <description>Descriptor fetch is enabled.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>NDSUP</name>
                        <description>Channel x Next Descriptor Source Update</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>NDSUPSelect</name>
                           <enumeratedValue>
                              <name>SRC_PARAMS_UNCHANGED</name>
                              <description>Source parameters remain unchanged.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SRC_PARAMS_UPDATED</name>
                              <description>Source parameters are updated when the descriptor is retrieved.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>NDDUP</name>
                        <description>Channel x Next Descriptor Destination Update</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>NDDUPSelect</name>
                           <enumeratedValue>
                              <name>DST_PARAMS_UNCHANGED</name>
                              <description>Destination parameters remain unchanged.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DST_PARAMS_UPDATED</name>
                              <description>Destination parameters are updated when the descriptor is retrieved.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>NDVIEW</name>
                        <description>Channel x Next Descriptor View</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>NDVIEWSelect</name>
                           <enumeratedValue>
                              <name>NDV0</name>
                              <description>Next Descriptor View 0</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NDV1</name>
                              <description>Next Descriptor View 1</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NDV2</name>
                              <description>Next Descriptor View 2</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>NDV3</name>
                              <description>Next Descriptor View 3</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CUBC</name>
                  <description>Channel Microblock Control Register (chid = 0)</description>
                  <addressOffset>0x20</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>UBLEN</name>
                        <description>Channel x Microblock Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>XDMAC_CBC</name>
                  <description>Channel Block Control Register (chid = 0)</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>BLEN</name>
                        <description>Channel x Block Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>12</bitWidth>
                     </field>
                  </fields>
               </register>
